{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting the QH monogram logo replacement in the Header component, linking it to test ID REQ-15 with high confidence.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing their purpose and key implementation details for the Quindore Holdings LLC site.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH CSS custom properties for light and dark theme color tokens including background, foreground, accent, and sidebar variables.",
  "frontend/index.html": "HTML entry point loading Google Fonts (Playfair Display and Inter), setting institutional meta tags for Quindore Holdings LLC, and mounting the React app at #root.",
  "frontend/src/App.tsx": "Main React app using TanStack Router to define routes for home, /structure, /governance, /privacy, /terms, /legal, and a 404 fallback, all wrapped in a shared Header/Footer layout.",
  "frontend/src/components/About.tsx": "Two-column About section with intersection-observer fade-in animations covering Quindore Holdings' parent company role, governance, capital discipline, and a consumer transaction disclaimer callout.",
  "frontend/src/components/ComplianceGovernance.tsx": "Four-block compliance and governance section with fade-in cards covering regulatory framework, internal compliance policies, financial reporting structure, and third-party payment processing.",
  "frontend/src/components/Contact.tsx": "Renders the Contact section with an intersection-observer-driven fade-in animation, displaying institutional correspondence instructions and a mailto link for info@quindore.com.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with brand info, registered address, and legal navigation links (Privacy, Terms, etc.), dynamically encoding the hostname for app identification.",
  "frontend/src/components/Header.tsx": "Fixed navigation header with scroll-aware styling, a mobile hamburger menu, and smooth anchor-scroll navigation that works both on and off the home route.",
  "frontend/src/components/Hero.tsx": "Full-screen hero section that fades in on mount, displaying the company tagline, a brief description, and a CTA button that smooth-scrolls to the Contact section.",
  "frontend/src/components/OperatingStructure.tsx": "Renders a four-tier corporate structure overview (Parent Entity, Subsidiaries, Operating Platforms, Trade Names) with staggered fade-in animations triggered by an IntersectionObserver.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an Internet Computer actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor instance changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status. Includes an `InternetIdentityProvider` component that persists identity across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file for backend query hooks; exports nothing as the site is static and requires no backend queries.",
  "frontend/src/index.css": "Global stylesheet defining Quindore brand design tokens (dark theme, gold accents) via CSS custom properties, Tailwind base/components/utilities layers, and reusable utility classes like gold dividers and section padding.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with `QueryClientProvider` and `InternetIdentityProvider` wrappers around the root `App` component.",
  "frontend/src/pages/GovernancePage.tsx": "Renders a multi-section governance documentation page for Quindore Holdings LLC covering board oversight, audit & compliance, risk management, and reporting obligations, with a sticky sidebar navigation.",
  "frontend/src/pages/LegalPage.tsx": "Displays the Legal Disclaimer page for Quindore Holdings LLC, covering informational purpose, non-investment-advisor status, and related disclaimers, with a back link to the home page.",
  "frontend/src/pages/PrivacyPage.tsx": "Renders the Privacy Policy page for Quindore Holdings LLC, describing minimal data collection practices for the informational website including server logs and email correspondence.",
  "frontend/src/pages/StructurePage.tsx": "Renders the Corporate Structure page for Quindore Holdings LLC, displaying a hierarchical tree diagram of the company's ownership and governance tiers with fade-in animations on scroll.",
  "frontend/src/pages/TermsPage.tsx": "Renders the Terms of Service legal page for Quindore Holdings LLC, presenting sections covering informational purpose, warranties, liability, and other legal terms with a last-updated date of February 25, 2026.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with Quindore brand color tokens (gold, dark surfaces), Playfair Display/Inter font families, custom border radii, shadows, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the project's current state (version 5) for the Quindore Holdings LLC corporate website, documenting architectural decisions, color/typography standards, implemented features, known issues, and image requirements."
}