{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (global theme, header, hero, etc.) to their source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing their purpose and key implementation details for the Quindore Holdings LLC site.",
  "frontend/index.css": "Tailwind base CSS with OKLCH-based design token variables for light and dark themes covering background, foreground, card, border, and chart colors.",
  "frontend/index.html": "HTML entry point that loads Google Fonts (Playfair Display and Inter), sets institutional meta tags for Quindore Holdings LLC, and mounts the React app.",
  "frontend/src/App.tsx": "Main React app using TanStack Router to define routes for home, /structure, /governance, /privacy, /terms, /legal, and a 404 page, all wrapped in a shared Layout with Header and Footer.",
  "frontend/src/components/About.tsx": "Two-column About section with fade-in-on-scroll animations covering Quindore's holding company role, centralized governance, capital discipline, and a consumer transaction disclaimer callout.",
  "frontend/src/components/ComplianceGovernance.tsx": "Four-block compliance and governance section with staggered fade-in animations covering regulatory framework, internal compliance policies, financial reporting, and third-party payment processing.",
  "frontend/src/components/Contact.tsx": "React component rendering the Contact section with an email link to info@quindore.com, using IntersectionObserver to trigger staggered fade-in animations on scroll.",
  "frontend/src/components/Footer.tsx": "Site footer component displaying the Quindore Holdings brand, registered address, and legal navigation links (Privacy, Terms, etc.) with a gold accent and dynamic copyright year.",
  "frontend/src/components/Header.tsx": "Fixed navigation header with a logo, desktop nav links, and a mobile hamburger menu; supports smooth anchor scrolling and cross-route navigation using TanStack Router.",
  "frontend/src/components/Hero.tsx": "Full-screen hero section with a headline, subtext describing Quindore Holdings, a Contact CTA button that scrolls to the contact section, and a fade-in entrance animation.",
  "frontend/src/components/OperatingStructure.tsx": "Section component that renders a four-tier corporate structure overview (Parent Entity, Subsidiaries, Operating Platforms, Trade Names) with staggered IntersectionObserver-driven fade-in animations.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an Internet Computer actor (authenticated or anonymous) using TanStack Query, and invalidates dependent queries whenever the actor or identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication using DFINITY's AuthClient, exposing login/logout functions and status flags. Includes an `InternetIdentityProvider` component that persists identity across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file for backend query hooks, kept to satisfy project structure requirements since the site is static and needs no backend queries.",
  "frontend/src/index.css": "Global stylesheet defining Quindore brand design tokens (dark theme, gold accents) as CSS custom properties, Tailwind base/component/utility layers, and reusable utility classes like gold dividers and CTA buttons.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with `QueryClientProvider` and `InternetIdentityProvider` wrappers around the root `App` component.",
  "frontend/src/pages/GovernancePage.tsx": "Renders a scrollable governance documentation page for Quindore Holdings LLC with a sticky sidebar navigation linking to sections covering board oversight, audit & compliance, risk management, and reporting obligations.",
  "frontend/src/pages/LegalPage.tsx": "Renders the Legal Disclaimer page for Quindore Holdings LLC, presenting formatted legal text clarifying the site's informational-only purpose, non-investment-advisor status, and related disclaimers.",
  "frontend/src/pages/PrivacyPage.tsx": "Renders the Privacy Policy page for Quindore Holdings LLC, describing minimal data collection practices (server logs and email only), cookie usage, and the policy's limited scope to the corporate website.",
  "frontend/src/pages/StructurePage.tsx": "Renders the Corporate Structure page for Quindore Holdings LLC, displaying a hierarchical tree diagram of ownership and governance with fade-in animations on scroll.",
  "frontend/src/pages/TermsPage.tsx": "Renders the Terms of Service legal page for Quindore Holdings LLC, presenting sections covering informational purpose, warranties, liability, and other legal terms with a back-to-home link.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with Quindore brand color tokens, custom fonts (Playfair Display, Inter), border radii, shadows, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the project's current state including version, architectural notes, known issues, image requirements, and a list of implemented features for the Quindore Holdings LLC corporate website."
}