{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report linking the QH monogram logo asset feature to Header and Footer components with high confidence.",
  "frontend-file-summaries.txt": "JSON map of all frontend source files to short descriptions covering their purpose, content, and styling details.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH CSS custom properties for light and dark theme color tokens used across the UI.",
  "frontend/index.html": "HTML entry point for Quindore Holdings LLC with Google Fonts imports for Playfair Display and Inter and institutional meta description.",
  "frontend/src/App.tsx": "Main React app defining TanStack Router routes for home, /structure, /governance, /privacy, /terms, /legal, and 404, all wrapped in a shared Layout with Header and Footer.",
  "frontend/src/components/About.tsx": "Two-column About section with intersection-observer fade-in animations covering the holding company's role, governance, capital discipline, and a consumer transaction disclaimer.",
  "frontend/src/components/ComplianceGovernance.tsx": "Four-block compliance and governance section with fade-in cards covering regulatory framework, internal standards, financial reporting, and third-party payment processing.",
  "frontend/src/components/Contact.tsx": "Renders the Contact section with an intersection-observer fade-in animation, displaying a description and a mailto link for institutional inquiries to Quindore Holdings LLC.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with brand info, registered address, and legal navigation links, dynamically deriving the app ID from the current hostname.",
  "frontend/src/components/Header.tsx": "Fixed navigation header with scroll-aware styling, desktop and mobile menus, and smooth anchor-scroll navigation that works from any route.",
  "frontend/src/components/Hero.tsx": "Full-screen hero section with a fade-in headline, subtext describing Quindore Holdings, and a CTA button that scrolls to the Contact section.",
  "frontend/src/components/OperatingStructure.tsx": "Displays a four-tier corporate structure overview (parent entity, subsidiaries, operating platforms, trade names) with staggered intersection-observer fade-in animations.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an Internet Computer actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication using DFINITY's AuthClient, exposing login/logout functions and status flags. Includes an InternetIdentityProvider component that persists identity across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file for backend query hooks, kept for project structure consistency. Exports nothing functional.",
  "frontend/src/index.css": "Global stylesheet defining Quindore brand design tokens (dark theme, gold accents) as CSS custom properties, Tailwind base/components/utilities layers, and reusable utility classes like gold dividers and CTA buttons.",
  "frontend/src/main.tsx": "React application entry point that mounts the app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/GovernancePage.tsx": "Static page displaying Quindore Holdings LLC's governance documentation across sections including board oversight, audit & compliance, risk management, and reporting obligations, with a scrollable sidebar navigation.",
  "frontend/src/pages/LegalPage.tsx": "Static legal disclaimer page for Quindore Holdings LLC covering informational purpose, non-advisory status, and related disclaimers, with a back-to-home link and formatted legal content.",
  "frontend/src/pages/PrivacyPage.tsx": "Static privacy policy page for Quindore Holdings LLC describing minimal data collection practices, cookie usage, and policy scope for the informational website.",
  "frontend/src/pages/StructurePage.tsx": "Renders the Corporate Structure page for Quindore Holdings LLC, displaying an animated hierarchical ownership/governance diagram with a back-to-home link and fade-in section effects.",
  "frontend/src/pages/TermsPage.tsx": "Renders the Terms of Service legal page for Quindore Holdings LLC, presenting sections on informational purpose, warranties, liability, and other legal terms with a last-updated date.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with Quindore brand color tokens, custom fonts (Playfair Display, Inter), border radii, shadows, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project metadata and state for the Quindore site, including schema version, existing features, known issues, and an image requirement to remove the black background from the QH monogram logo."
}