{
  "kind": "build_request",
  "title": "Integrate uploaded QH monogram logo into site header and hero",
  "projectName": "Quindore Holdings",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-15",
      "text": "Replace the current generated 'Q' monogram placeholder in the site header with the uploaded QH monogram logo image (saved as frontend/public/assets/generated/qh-logo.png). Display it as the left-aligned logo lockup in the Header component. The logo must be sized appropriately for the fixed header (height ~40–48px on desktop, ~32px on mobile), and must render on the dark header background without a white box or border — use the transparent-background version of the asset. Alongside the monogram, retain or add the 'Quindore Holdings LLC' wordmark text in Playfair Display to its right.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "This is company logo"
        ]
      },
      "acceptanceCriteria": [
        "The QH gold monogram logo image is displayed in the Header, left-aligned, at correct proportions",
        "The logo background is transparent — no white box visible against the dark header",
        "On mobile the logo scales down gracefully without cropping",
        "The 'Quindore Holdings LLC' wordmark text appears beside the monogram in Playfair Display",
        "The logo links to the home page (/)"
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/ or frontend/src/components/ui/",
    "Preserve all existing header navigation links and responsive hamburger menu behavior"
  ],
  "nonGoals": [
    "Redesigning or restructuring any other site section",
    "Changing color tokens, typography, or global theme settings",
    "Adding new pages or routes"
  ],
  "imageRequirements": {
    "required": [],
    "edits": [
      "Remove the white background and output a transparent PNG of the gold QH monogram lettermark on a transparent background (IMG_20260226_034111-1.png > qh-logo.dim_256x256.png)"
    ]
  }
}